mlorentedev/embedded-systems-coursework/rtos/ti-cc3200/i2cAcc/utils/uartstdio.c
//*****************************************************************************
//
// uartstdio.c - Utility driver to provide simple UART console functions.
//
// Copyright (c) 2007-2014 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.0.12573 of the Tiva Utility Library.
//
//*****************************************************************************
//JMCG, EGP, NHR: Modificado para:
// -> portada al CC3200...
// -> Simplificar la rutina de interrupcion, eliminando código y pasándolo a funciones que se llaman desde tareas
// -> Mejorar la integracion con FreeRTOS mediante colas de mensajes
// -> Pasar parte del procesado a la función gets, que ademas se hace bloqueante. Esta funcion solo debe usarse en tareas
// -> Incluir la opción de historial (funcion gets)



#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/prcm.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

//*****************************************************************************
//
//! \addtogroup uartstdio_api
//! @{
//
//*****************************************************************************



//*****************************************************************************
//
// This global controls whether or not we are echoing characters back to the
// transmitter.  By default, echo is enabled but if using this module as a
// convenient method of implementing a buffered serial interface over which
// you will be running an application protocol, you are likely to want to
// disable echo by calling UARTEchoSet(false).
//
//*****************************************************************************
static bool g_bDisableEcho;

//*****************************************************************************
//
// Use RTOS queues as buffers,
//
//*****************************************************************************


/* The queue used to hold received characters. */
static QueueHandle_t xRxedChars;

/* The queue used to hold characters waiting transmission. */
static QueueHandle_t xCharsForTx;


//The ISR
static void UARTStdioIntHandler (void);


#ifdef WANT_CMDLINE_HISTORY
// Extended History support variables
static char g_pcUARTRxHistoryBuffer[UART_RX_HISTORY_BUF_SIZE];
static unsigned short g_usUARTRxHistoryOffset[UART_RX_HISTORY_DEPTH];
static unsigned short g_usUARTRxHistoryBufIndex = 0;
static signed char g_bUARTRxHistoryNext = 0;
static signed char g_bUARTRxHistoryCur = -1;
static signed char g_bUARTRxHistoryCnt = 0;
static unsigned char g_ubEscMode = 0;
#endif /* WANT_CMDLINE_HISTORY */

//*****************************************************************************
//
// The base address of the chosen UART.
//
//*****************************************************************************
static uint32_t g_ui32Base = 0;

//*****************************************************************************
//
// A mapping from an integer between 0 and 15 to its ASCII character
// equivalent.
//
//*****************************************************************************
static const char * const g_pcHex = "0123456789abcdef";

//*****************************************************************************
//
// The list of possible base addresses for the console UART.
//
//*****************************************************************************
static const uint32_t g_ui32UARTBase[2] =
{
		UARTA0_BASE, UARTA1_BASE
};


//*****************************************************************************
//
// The list of possible interrupts for the console UART.
//
//*****************************************************************************
static const uint32_t g_ui32UARTInt[2] =
{
		INT_UARTA0, INT_UARTA1
};

//*****************************************************************************
//
// The port number in use.
//
//*****************************************************************************
static uint32_t g_ui32PortNum;


//*****************************************************************************
//
// The list of UART peripherals.
//
//*****************************************************************************
static const uint32_t g_ui32UARTPeriph[2] =
{
		PRCM_UARTA0, PRCM_UARTA1
};



//*****************************************************************************
//
// Take as many bytes from the transmit buffer as we have space for and move
// them into the UART transmit FIFO.
//
//*****************************************************************************

static void UARTPrimeTransmit(uint32_t ui32Base)
{
		//
		// Disable the UART interrupt.  If we don't do this there is a race
		// condition which can cause the read index to be corrupted.
		//
		MAP_UARTIntDisable(g_ui32Base, UART_INT_TX);

		//
		// Yes - take some characters out of the transmit buffer and feed
		// them to the UART transmit FIFO.
		//
		while(UARTSpaceAvail(ui32Base) && (uxQueueMessagesWaiting(xCharsForTx)))
		{
			uint8_t data;
			xQueueReceive(xCharsForTx,&data,portMAX_DELAY);
			MAP_UARTCharPutNonBlocking(ui32Base,data);
		}

		//
		// Reenable the UART interrupt.
		//
		MAP_UARTIntEnable(g_ui32Base, UART_INT_TX);
}




//*****************************************************************************
//
//! Configures the UART console.
//!
//! \param ui32PortNum is the number of UART port to use for the serial console
//! (0-2)
//! \param ui32Baud is the bit rate that the UART is to be configured to use.
//!
//! This function will configure the specified serial port to be used as a
//! serial console.  The serial parameters are set to the baud rate
//! specified by the \e ui32Baud parameter and use 8 bit, no parity, and 1 stop
//! bit.
//!
//! This function must be called prior to using any of the other UART console
//! functions: UARTprintf() or UARTgets().  This function assumes that the
//! caller has previously configured the relevant UART pins for operation as a
//! UART rather than as GPIOs.
//!
//! \return None.
//
//*****************************************************************************
//Initializes the UART and creates the messaque queues for TX and RX
void
UARTStdioConfig(uint32_t ui32PortNum, uint32_t ui32Baud)
{
	//
	// Check the arguments.
	//
	ASSERT((ui32PortNum == 0) || (ui32PortNum == 1) ||
			(ui32PortNum == 2));


	//
	// In buffered mode, we only allow a single instance to be opened.
	//
	ASSERT(g_ui32Base == 0);


	//
	// Select the base address of the UART.
	//
	g_ui32Base = g_ui32UARTBase[ui32PortNum];

	//
	// Enable the UART peripheral for use.
	//
	MAP_PRCMPeripheralClkEnable  ( g_ui32UARTPeriph[ui32PortNum],PRCM_RUN_MODE_CLK|PRCM_SLP_MODE_CLK ); //JMCG clock activo en sleep

	//
	// Configure the UART for 115200, n, 8, 1
	//
	MAP_UARTConfigSetExpClk(g_ui32Base, MAP_PRCMPeripheralClockGet(g_ui32UARTPeriph[ui32PortNum]), ui32Baud,
			(UART_CONFIG_PAR_NONE | UART_CONFIG_STOP_ONE |
					UART_CONFIG_WLEN_8));

	//
	// Set the UART to interrupt whenever the TX FIFO is almost empty or
	// when any character is received.
	//
	MAP_UARTFIFOLevelSet(g_ui32Base, UART_FIFO_TX1_8, UART_FIFO_RX1_8);

	//
	// Remember which interrupt we are dealing with.
	//
	g_ui32PortNum = ui32PortNum;

	//
	// We are configured for buffered output so enable the master interrupt
	// for this UART and the receive interrupts.  We don't actually enable the
	// transmit interrupt in the UART itself until some data has been placed
	// in the transmit buffer.
	//
	MAP_UARTIntDisable(g_ui32Base, 0xFFFFFFFF);

	// Set the interrupt priority
	MAP_IntPrioritySet(g_ui32UARTInt[ui32PortNum], configMAX_SYSCALL_INTERRUPT_PRIORITY);

	xRxedChars = xQueueCreate( UART_RX_BUFFER_SIZE, ( unsigned portBASE_TYPE ) sizeof( signed char ) );
	xCharsForTx = xQueueCreate( UART_TX_BUFFER_SIZE, ( unsigned portBASE_TYPE ) sizeof( signed char ) );

	//
	// Flush both the buffers.
	//
	UARTFlushRx();
	UARTFlushTx(true);

