mlorentedev/embedded-systems-coursework/rtos/ti-cc3200/i2cAcc/utils/uartstdio.c
	MAP_IntRegister(g_ui32UARTInt[ui32PortNum],UARTStdioIntHandler); //La tabla de vectores esta en RAM de todas formas...
	MAP_UARTIntEnable(g_ui32Base, UART_INT_RX | UART_INT_RT);
	MAP_IntEnable(g_ui32UARTInt[ui32PortNum]);

	//
	// Enable the UART operation.
	//
	MAP_UARTEnable(g_ui32Base);
}

//*****************************************************************************
//
//! Writes a string of characters to the UART output.
//!
//! \param pcBuf points to a buffer containing the string to transmit.
//! \param ui32Len is the length of the string to transmit.
//!
//! This function will transmit the string to the UART output.  The number of
//! characters transmitted is determined by the \e ui32Len parameter.  This
//! function does no interpretation or translation of any characters.  Since
//! the output is sent to a UART, any LF (/n) characters encountered will be
//! replaced with a CRLF pair.
//!
//! Besides using the \e ui32Len parameter to stop transmitting the string, if
//! a null character (0) is encountered, then no more characters will be
//! transmitted and the function will return.
//!
//! In non-buffered mode, this function is blocking and will not return until
//! all the characters have been written to the output FIFO.  In buffered mode,
//! the characters are written to the UART transmit buffer and the call returns
//! immediately.  If insufficient space remains in the transmit buffer,
//! additional characters are discarded.
//!
//! \return Returns the count of characters written.
//
//*****************************************************************************
int
UARTwrite(const char *pcBuf, uint32_t ui32Len)
{
	unsigned int uIdx;

	//
	// Check for valid arguments.
	//
	ASSERT(pcBuf != 0);
	ASSERT(g_ui32Base != 0);

	//
	// Send the characters
	//
	for(uIdx = 0; uIdx < ui32Len; uIdx++)
	{
		//
		// If the character to the UART is \n, then add a \r before it so that
		// \n is translated to \n\r in the output.
		//
		if(pcBuf[uIdx] == '\n')
		{
				const uint8_t data='\r';
				xQueueSend(xCharsForTx,&data,portMAX_DELAY);
				UARTPrimeTransmit(g_ui32Base);
		}

		//
		// Send the character to the UART output.
		//
		xQueueSend(xCharsForTx,(pcBuf+uIdx),portMAX_DELAY);
		UARTPrimeTransmit(g_ui32Base);
	}

	//
	// Return the number of characters written.
	//
	return(uIdx);
}


//*****************************************************************************
//
//! A simple UART based get string function, with some line processing.
//!
//! \param pcBuf points to a buffer for the incoming string from the UART.
//! \param ui32Len is the length of the buffer for storage of the string,
//! including the trailing 0.
//!
//! This function will receive a string from the UART input and store the
//! characters in the buffer pointed to by \e pcBuf.  The characters will
//! continue to be stored until a termination character is received.  The
//! termination characters are CR, LF, or ESC.  A CRLF pair is treated as a
//! single termination character.  The termination characters are not stored in
//! the string.  The string will be terminated with a 0 and the function will
//! return.
//!
//! In both buffered and unbuffered modes, this function will block until
//! a termination character is received.  If non-blocking operation is required
//! in buffered mode, a call to UARTPeek() may be made to determine whether
//! a termination character already exists in the receive buffer prior to
//! calling UARTgets().
//!
//! Since the string will be null terminated, the user must ensure that the
//! buffer is sized to allow for the additional null character.
//!
//! \return Returns the count of characters that were stored, not including
//! the trailing 0.
//
//*****************************************************************************

//JMCG: Con respecto al original suministrado por Texas Instruments,
// Se ha pasado gran parte de la ISR a esta funcion (que se ejecutara desde tarea)
// En concreto se pasa aquí la gestión de los carácteres de borrado, del eco y del historial,
// ya que no tiene sentido hacerlo en la ISR.


int
UARTgets(char *pcBuf, uint32_t ui32Len)
{
	uint32_t ui32Count = 0;
	int8_t cChar;
	bool bLastWasCR = false;

	//
	// Check the arguments.
	//
	ASSERT(pcBuf != 0);
	ASSERT(ui32Len != 0);
	ASSERT(g_ui32Base != 0);

	//
	// Adjust the length back by 1 to leave space for the trailing
	// null terminator.
	//
	ui32Len--;

	//
	// Process characters until a newline is received.
	//
	while(ui32Count<ui32Len)
	{
		//
		// Read the next character from the receive buffer.
		//
		xQueueReceive(xRxedChars,&cChar,portMAX_DELAY);

		//
		// If echo is disabled, we skip the various text filtering
		// operations that would typically be required when supporting a
		// command line.
		//
		if(!g_bDisableEcho)
		{
			//
			// Handle backspace by erasing the last character in the
			// buffer.
			//
			if ((cChar == '\b')||(cChar == 0x7F))
			{
				//
				// If there are any characters already in the buffer, then
				// delete the last.
				//

				if((ui32Count>0))
				{
					//
					// Rub out the previous character on the users
					// terminal.
					//
					UARTwrite("\b \b", 3);
					ui32Count--; //Delete from buffer

				}

				//
				// Skip ahead to read the next character.
				//
				continue;
			}

			//
			// Check if in an ESC sequence (arrow keys)
			//
			// El código de abajo implementa el historial de comandos...
#ifdef WANT_CMDLINE_HISTORY
			if (g_ubEscMode != 0)
			{
				// Test if this is the first byte after the ESCape
				if (g_ubEscMode == 1)
				{
					// Test the known escape codes
					if (cChar == '[')
					{
						g_ubEscMode = 2;
						continue;
					}
					else
						// Unknown code
					{
						g_ubEscMode = 0;
						continue;
					}
				}
				else
				{
					// Test for UP or DOWN arrow
					if ((cChar == 'A') || (cChar == 'B'))
					{
						unsigned short copyFrom, x;
						int current = g_bUARTRxHistoryCur;

						g_ubEscMode = 0;

						if (cChar == 'A')
						{
							// Test if this is the first history request
							if (current == -1)
								current = g_bUARTRxHistoryNext;

							// Now decrement to previous history
							if (--current < 0)
								current = UART_RX_HISTORY_DEPTH-1;

							// Get previous history into Rx buffer
							if ((g_bUARTRxHistoryNext == g_bUARTRxHistoryCur) ||
									(current > g_bUARTRxHistoryCnt))
							{
								// At end of history.  Just return
								UARTwrite("\x07", 1);
								continue;
							}
						}
						else
						{
							// Test if this is the first history request
							if (current == -1)
								continue;

							// Now increment to next history
							if (++current >= UART_RX_HISTORY_DEPTH)
								current = 0;

