mlorentedev/embedded-systems-coursework/rtos/ti-cc3200/i2cAcc/utils/uartstdio.c
							// Test if we were on the last history item
							if (current == g_bUARTRxHistoryNext)
							{
								UARTwrite("\r\x1b[2K> ", 7);
								//Clear the line
								ui32Count=0;
								g_bUARTRxHistoryCur = -1;
								continue;
							}
						}
						g_bUARTRxHistoryCur = current;

						// Copy the history item to the Rx Buffer
						UARTwrite("\r\x1b[2K> ", 7);
						ui32Count=0; //Clear the line
						copyFrom = g_usUARTRxHistoryOffset[current];
						for (x = 0; g_pcUARTRxHistoryBuffer[copyFrom] != '\0'; x++)
						{
							pcBuf[ui32Count]=g_pcUARTRxHistoryBuffer[copyFrom++];

							UARTwrite((const char *) &pcBuf[ui32Count], 1);

							ui32Count++;
							if (copyFrom >= UART_RX_HISTORY_BUF_SIZE)
								copyFrom = 0;
						}
						pcBuf[ui32Count] = '\0';

						continue;
					}
					// Test for LEFT arrow
					else if (cChar == 'C')
					{
						g_ubEscMode = 0;
						continue;
					}
					// Test for RIGHT arrow
					else if (cChar == 'D')
					{
						g_ubEscMode = 0;
						continue;
					}
					else
						// Unknown sequence
					{
						g_ubEscMode = 0;
						continue;
					}
				}
			}
#endif /* WANT_CMDLINE_HISTORY */

			//
			// If this character is LF and last was CR, then just gobble up
			// the character since we already echoed the previous CR and we
			// don't want to store 2 characters in the buffer if we don't
			// need to.
			//
			if((cChar == '\n') && bLastWasCR)
			{
				bLastWasCR = false;
#ifdef WANT_CMDLINE_HISTORY
				g_ubEscMode = 0;
#endif /* WANT_CMDLINE_HISTORY */
				continue;
			}

#ifdef WANT_CMDLINE_HISTORY
			//
			// Test for ESC sequence
			//
			if (cChar == 0x1b)
			{
				bLastWasCR = false;
#ifdef WANT_CMDLINE_HISTORY
				g_ubEscMode = 1;
#endif /* WANT_CMDLINE_HISTORY */
				continue;
			}
#endif

			//
			// See if a newline or escape character was received.
			//
			if((cChar == '\r') || (cChar == '\n') || (cChar == 0x1b))
			{
				signed char  next, prev;
				int count;
				uint32_t x;

				//
				// If this character is LF and last was CR, then just gobble up
				// the character since we already echoed the previous CR and we
				// don't want to store 2 characters in the buffer if we don't
				// need to.
				//
				if((cChar == '\n') && bLastWasCR)
				{
					bLastWasCR = false;
					continue;
				}

				//
				// See if a newline or escape character was received.
				//
				if((cChar == '\r') || (cChar == '\n') || (cChar == 0x1b))
				{
					//
					// If the character is a CR, then it may be followed by an
					// LF which should be paired with the CR.  So remember that
					// a CR was received.
					//
					if(cChar == '\r')
					{
						bLastWasCR = 1;
					}

					//
					// Regardless of the line termination character received,
					// put a CR in the receive buffer as a marker telling
					// UARTgets() where the line ends.  We also send an
					// additional LF to ensure that the local terminal echo
					// receives both CR and LF.
					//
					cChar = '\r';
					UARTwrite("\n", 1);

					//
					// Add command to the command history
					//
					if (ui32Count > 0)
					{
						int y, duplicateCmd;

						// Test if this command matches the last command
						duplicateCmd = false;
						if (g_bUARTRxHistoryCnt > 0)
						{
							prev = g_bUARTRxHistoryNext-1;
							if (prev < 0)
								prev = UART_RX_HISTORY_DEPTH-1;

							x = 0;
							y = g_usUARTRxHistoryOffset[prev];
							for (count=ui32Count; count > 0; count--)
							{
								if (g_pcUARTRxHistoryBuffer[y++] != pcBuf[x++]) //g_pcUARTRxBuffer[x++])
									break;
								if (y >= UART_RX_HISTORY_BUF_SIZE)
									y = 0;
							}

							// Test if the command matches the last
							if ((count == 0) && (g_pcUARTRxHistoryBuffer[y] == 0))
								duplicateCmd = true;
						}

						// Now save the command in the history buffer
						if (!duplicateCmd)
						{
							next = g_bUARTRxHistoryNext++;
							if (g_bUARTRxHistoryNext == UART_RX_HISTORY_DEPTH)
								g_bUARTRxHistoryNext = 0;
							if (g_bUARTRxHistoryCnt != UART_RX_HISTORY_DEPTH)
								g_bUARTRxHistoryCnt++;
							g_usUARTRxHistoryOffset[next] = g_usUARTRxHistoryBufIndex;

							x =0;
							for (count = ui32Count ; count > 0 ; count--)
							{

								g_pcUARTRxHistoryBuffer[g_usUARTRxHistoryBufIndex++] =pcBuf[x++];
								if (g_usUARTRxHistoryBufIndex >= UART_RX_HISTORY_BUF_SIZE)
									g_usUARTRxHistoryBufIndex = 0;
							}
							g_pcUARTRxHistoryBuffer[g_usUARTRxHistoryBufIndex++] = '\0';
							if (g_usUARTRxHistoryBufIndex >= UART_RX_HISTORY_BUF_SIZE)
								g_usUARTRxHistoryBufIndex = 0;
						}
					}
					g_bUARTRxHistoryCur = -1;
				}

				break;
			} //This is the end of the end of line.....

			//Envia el eco...
			UARTwrite((const char *)&cChar, 1);

		}	//If disable echo....

		//
		// Process the received character as long as we are not at the end
		// of the buffer.  If the end of the buffer has been reached then
		// all additional characters are ignored until a newline is
		// received.
		//
		if(ui32Count < ui32Len)
		{
			//
			// Store the character in the caller supplied buffer.
			//
			pcBuf[ui32Count] = cChar;

			//
			// Increment the count of characters received.
			//
			ui32Count++;
		}

	} // The while (datos<esperados) {read and process}

//
// Add a null termination to the string.
//
	pcBuf[ui32Count] = 0;

//
// Return the count of int8_ts in the buffer, not counting the trailing 0.
//
	return(ui32Count);
}

//*****************************************************************************
//
//! Read a single character from the UART, blocking if necessary.
//!
//! This function will receive a single character from the UART and store it at
//! the supplied address.
//!
//! In both buffered and unbuffered modes, this function will block until a
//! character is received.  If non-blocking operation is required in buffered
//! mode, a call to UARTRxAvail() may be made to determine whether any
//! characters are currently available for reading.
//!
//! \return Returns the character read.
//
//*****************************************************************************
unsigned char
UARTgetc(void)
{
	unsigned char cChar;

	//
	// Wait for a character to be received and read a character from the buffer.
	//
	xQueueReceive(xRxedChars,&cChar,portMAX_DELAY);

	//
	// Return the character to the caller.
	//
	return(cChar);
}

//*****************************************************************************
//
//! A simple UART based vprintf function supporting \%c, \%d, \%p, \%s, \%u,
//! \%x, and \%X.
//!
//! \param pcString is the format string.
//! \param vaArgP is a variable argument list pointer whose content will depend
//! upon the format string passed in \e pcString.
//!
//! This function is very similar to the C library <tt>vprintf()</tt> function.
//! All of its output will be sent to the UART.  Only the following formatting
//! characters are supported:
//!
//! - \%c to print a character
//! - \%d or \%i to print a decimal value
//! - \%s to print a string
//! - \%u to print an unsigned decimal value
//! - \%x to print a hexadecimal value using lower case letters
//! - \%X to print a hexadecimal value using lower case letters (not upper case
//! letters as would typically be used)
//! - \%p to print a pointer as a hexadecimal value
//! - \%\% to print out a \% character
//!
//! For \%s, \%d, \%i, \%u, \%p, \%x, and \%X, an optional number may reside
//! between the \% and the format character, which specifies the minimum number
//! of characters to use for that value; if preceded by a 0 then the extra
//! characters will be filled with zeros instead of spaces.  For example,
//! ``\%8d'' will use eight characters to print the decimal value with spaces
//! added to reach eight; ``\%08d'' will use eight characters as well but will
//! add zeroes instead of spaces.
//!
//! The type of the arguments in the variable arguments list must match the
//! requirements of the format string.  For example, if an integer was passed
//! where a string was expected, an error of some kind will most likely occur.
//!
//! \return None.
//
//*****************************************************************************
void
UARTvprintf(const char *pcString, va_list vaArgP)
{
	uint32_t ui32Idx, ui32Value, ui32Pos, ui32Count, ui32Base, ui32Neg;
	char *pcStr, pcBuf[16], cFill;

	//
	// Check the arguments.
	//
	ASSERT(pcString != 0);

	//
	// Loop while there are more characters in the string.
	//
	while(*pcString)
	{
		//
		// Find the first non-% character, or the end of the string.
		//
		for(ui32Idx = 0;
				(pcString[ui32Idx] != '%') && (pcString[ui32Idx] != '\0');
				ui32Idx++)
		{
		}

		//
		// Write this portion of the string.
		//
		UARTwrite(pcString, ui32Idx);

		//
		// Skip the portion of the string that was written.
		//
		pcString += ui32Idx;

		//
		// See if the next character is a %.
		//
		if(*pcString == '%')
		{
			//
			// Skip the %.
			//
			pcString++;

			//
			// Set the digit count to zero, and the fill character to space
			// (in other words, to the defaults).
			//
			ui32Count = 0;
			cFill = ' ';

			//
			// It may be necessary to get back here to process more characters.
			// Goto's aren't pretty, but effective.  I feel extremely dirty for
			// using not one but two of the beasts.
			//
			again:

			//
			// Determine how to handle the next character.
			//
			switch(*pcString++)
			{
			//
			// Handle the digit characters.
			//
			case '0':
			case '1':
			case '2':
			case '3':
			case '4':
			case '5':
			case '6':
			case '7':
			case '8':
			case '9':
			{
				//
				// If this is a zero, and it is the first digit, then the
				// fill character is a zero instead of a space.
				//
				if((pcString[-1] == '0') && (ui32Count == 0))
				{
					cFill = '0';
				}

				//
				// Update the digit count.
				//
				ui32Count *= 10;
				ui32Count += pcString[-1] - '0';

				//
				// Get the next character.
				//
				goto again;
			}

			//
			// Handle the %c command.
			//
			case 'c':
			{
				//
				// Get the value from the varargs.
				//
				ui32Value = va_arg(vaArgP, uint32_t);

				//
				// Print out the character.
				//
				UARTwrite((char *)&ui32Value, 1);

				//
				// This command has been handled.
				//
				break;
			}

			//
			// Handle the %d and %i commands.
			//
			case 'd':
			case 'i':
			{
				//
				// Get the value from the varargs.
				//
				ui32Value = va_arg(vaArgP, uint32_t);

				//
				// Reset the buffer position.
				//
				ui32Pos = 0;

				//
				// If the value is negative, make it positive and indicate
				// that a minus sign is needed.
				//
				if((int32_t)ui32Value < 0)
				{
					//
					// Make the value positive.
					//
					ui32Value = -(int32_t)ui32Value;

					//
					// Indicate that the value is negative.
					//
					ui32Neg = 1;
				}
				else
				{
					//
					// Indicate that the value is positive so that a minus
					// sign isn't inserted.
					//
					ui32Neg = 0;
				}

				//
				// Set the base to 10.
				//
				ui32Base = 10;

				//
				// Convert the value to ASCII.
				//
				goto convert;
			}

			//
			// Handle the %s command.
			//
			case 's':
			{
				//
				// Get the string pointer from the varargs.
				//
				pcStr = va_arg(vaArgP, char *);

				//
				// Determine the length of the string.
				//
				for(ui32Idx = 0; pcStr[ui32Idx] != '\0'; ui32Idx++)
				{
				}

				//
				// Write the string.
				//
				UARTwrite(pcStr, ui32Idx);

				//
				// Write any required padding spaces
				//
				if(ui32Count > ui32Idx)
				{
					ui32Count -= ui32Idx;
					while(ui32Count--)
					{
						UARTwrite(" ", 1);
					}
				}

				//
				// This command has been handled.
				//
				break;
			}

			//
			// Handle the %u command.
			//
			case 'u':
			{
				//
				// Get the value from the varargs.
				//
				ui32Value = va_arg(vaArgP, uint32_t);

				//
				// Reset the buffer position.
				//
				ui32Pos = 0;

				//
				// Set the base to 10.
				//
				ui32Base = 10;

				//
				// Indicate that the value is positive so that a minus sign
				// isn't inserted.
				//
				ui32Neg = 0;

				//
				// Convert the value to ASCII.
				//
				goto convert;
			}

			//
			// Handle the %x and %X commands.  Note that they are treated
			// identically; in other words, %X will use lower case letters
			// for a-f instead of the upper case letters it should use.  We
			// also alias %p to %x.
			//
			case 'x':
			case 'X':
			case 'p':
			{
				//
				// Get the value from the varargs.
				//
				ui32Value = va_arg(vaArgP, uint32_t);

				//
				// Reset the buffer position.
				//
				ui32Pos = 0;

				//
				// Set the base to 16.
				//
				ui32Base = 16;

				//
				// Indicate that the value is positive so that a minus sign
				// isn't inserted.
				//
				ui32Neg = 0;

				//
				// Determine the number of digits in the string version of
				// the value.
				//
				convert:
				for(ui32Idx = 1;
						(((ui32Idx * ui32Base) <= ui32Value) &&
								(((ui32Idx * ui32Base) / ui32Base) == ui32Idx));
						ui32Idx *= ui32Base, ui32Count--)
				{
				}

				//
				// If the value is negative, reduce the count of padding
				// characters needed.
				//
				if(ui32Neg)
				{
					ui32Count--;
				}

				//
				// If the value is negative and the value is padded with
				// zeros, then place the minus sign before the padding.
				//
				if(ui32Neg && (cFill == '0'))
				{
					//
					// Place the minus sign in the output buffer.
					//
					pcBuf[ui32Pos++] = '-';

					//
					// The minus sign has been placed, so turn off the
					// negative flag.
					//
					ui32Neg = 0;
				}

				//
				// Provide additional padding at the beginning of the
				// string conversion if needed.
				//
				if((ui32Count > 1) && (ui32Count < 16))
				{
					for(ui32Count--; ui32Count; ui32Count--)
					{
						pcBuf[ui32Pos++] = cFill;
					}
				}

				//
				// If the value is negative, then place the minus sign
				// before the number.
				//
				if(ui32Neg)
				{
					//
					// Place the minus sign in the output buffer.
					//
					pcBuf[ui32Pos++] = '-';
				}

				//
				// Convert the value into a string.
				//
				for(; ui32Idx; ui32Idx /= ui32Base)
				{
					pcBuf[ui32Pos++] =
							g_pcHex[(ui32Value / ui32Idx) % ui32Base];
				}

				//
				// Write the string.
				//
				UARTwrite(pcBuf, ui32Pos);

				//
				// This command has been handled.
				//
				break;
			}

			//
			// Handle the %% command.
			//
			case '%':
			{
				//
				// Simply write a single %.
				//
				UARTwrite(pcString - 1, 1);

				//
				// This command has been handled.
				//
				break;
			}

			//
			// Handle all other commands.
			//
			default:
			{
				//
				// Indicate an error.
				//
				UARTwrite("ERROR", 5);

				//
				// This command has been handled.
				//
				break;
			}
			}
		}
	}
}

//*****************************************************************************
//
//! A simple UART based printf function supporting \%c, \%d, \%p, \%s, \%u,
//! \%x, and \%X.
//!
//! \param pcString is the format string.
//! \param ... are the optional arguments, which depend on the contents of the
//! format string.
//!
//! This function is very similar to the C library <tt>fprintf()</tt> function.
//! All of its output will be sent to the UART.  Only the following formatting
//! characters are supported:
//!
//! - \%c to print a character
//! - \%d or \%i to print a decimal value
//! - \%s to print a string
//! - \%u to print an unsigned decimal value
//! - \%x to print a hexadecimal value using lower case letters
//! - \%X to print a hexadecimal value using lower case letters (not upper case
//! letters as would typically be used)
//! - \%p to print a pointer as a hexadecimal value
//! - \%\% to print out a \% character
//!
//! For \%s, \%d, \%i, \%u, \%p, \%x, and \%X, an optional number may reside
//! between the \% and the format character, which specifies the minimum number
//! of characters to use for that value; if preceded by a 0 then the extra
//! characters will be filled with zeros instead of spaces.  For example,
//! ``\%8d'' will use eight characters to print the decimal value with spaces
//! added to reach eight; ``\%08d'' will use eight characters as well but will
//! add zeroes instead of spaces.
//!
//! The type of the arguments after \e pcString must match the requirements of
//! the format string.  For example, if an integer was passed where a string
//! was expected, an error of some kind will most likely occur.
//!
//! \return None.
//
//*****************************************************************************
void
UARTprintf(const char *pcString, ...)
{
	va_list vaArgP;

	//
	// Start the varargs processing.
	//
	va_start(vaArgP, pcString);

	UARTvprintf(pcString, vaArgP);

	//
	// We're finished with the varargs now.
	//
	va_end(vaArgP);
}

//*****************************************************************************
//
//! Returns the number of bytes available in the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the number
//! of bytes of data currently available in the receive buffer.
//!
//! \return Returns the number of available bytes.
//
//*****************************************************************************

int
UARTRxBytesAvail(void)
{
	return((uxQueueMessagesWaiting(xRxedChars)));
}



//*****************************************************************************
//
//! Returns the number of bytes free in the transmit buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the amount
//! of space currently available in the transmit buffer.
//!
//! \return Returns the number of free bytes.
//
//*****************************************************************************
int
UARTTxBytesFree(void)
{
	return(uxQueueSpacesAvailable(xCharsForTx));
}




//*****************************************************************************
//
//! Flushes the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to discard any data
//! received from the UART but not yet read using UARTgets().
//!
//! \return None.
//
//*****************************************************************************
void
UARTFlushRx(void)
{
	//
	// Flush the receive buffer.
	//
	xQueueReset( xRxedChars );

