mlorentedev/embedded-systems-coursework/rtos/ti-cc3200/i2cAcc/utils/uartstdio.c
}


//*****************************************************************************
//
//! Flushes the transmit buffer.
//!
//! \param bDiscard indicates whether any remaining data in the buffer should
//! be discarded (\b true) or transmitted (\b false).
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to flush the transmit
//! buffer, either discarding or transmitting any data received via calls to
//! UARTprintf() that is waiting to be transmitted.  On return, the transmit
//! buffer will be empty.
//!
//! \return None.
//
//*****************************************************************************

void UARTFlushTx(bool bDiscard)
{
	//
	// Should the remaining data be discarded or transmitted?
	//
	if(bDiscard)
	{
		xQueueReset( xCharsForTx );

	}
	else
	{
		//
		// Wait for all remaining data to be transmitted before returning.
		//
		while(uxQueueMessagesWaiting(xCharsForTx))
		{
		}
	}
}


//*****************************************************************************
//
//! Enables or disables echoing of received characters to the transmitter.
//!
//! \param bEnable must be set to \b true to enable echo or \b false to
//! disable it.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to control whether or not
//! received characters are automatically echoed back to the transmitter.  By
//! default, echo is enabled and this is typically the desired behavior if
//! the module is being used to support a serial command line.  In applications
//! where this module is being used to provide a convenient, buffered serial
//! interface over which application-specific binary protocols are being run,
//! however, echo may be undesirable and this function can be used to disable
//! it.
//!
//! \return None.
//
//*****************************************************************************

void
UARTEchoSet(bool bEnable)
{
	g_bDisableEcho = !bEnable;
}


//*****************************************************************************
//
//! Handles UART interrupts.
//!
//! This function handles interrupts from the UART.  It will copy data from the
//! transmit buffer to the UART transmit FIFO if space is available, and it
//! will copy data from the UART receive FIFO to the receive buffer if data is
//! available.
//!
//! \return None.
//
//*****************************************************************************
//JMCG: Modificado de forma que la ISR quede lo más corta posible y utilice las colas de mensaje. El procesado de los datos recibido
// lo completa la funcion UARTgetc o UARTgets, que se ejecutarán desde una tarea.


void UARTStdioIntHandler(void)
{
	uint32_t ui32Ints;
	int8_t cChar;
	int32_t i32Char;
	portBASE_TYPE xHigherPriorityTaskWoken=false;


	//
	// Get and clear the current interrupt source(s)
	//
	ui32Ints = MAP_UARTIntStatus(g_ui32Base, true);
	MAP_UARTIntClear(g_ui32Base, ui32Ints);

	//
	// Are we being interrupted because the TX FIFO has space available?
	//
	if(ui32Ints & UART_INT_TX)
	{
		//
		// Move as many bytes as we can into the transmit FIFO.
		//
		while(MAP_UARTSpaceAvail(g_ui32Base) && !xQueueIsQueueEmptyFromISR(xCharsForTx))
		{
			uint8_t data;
			xQueueReceiveFromISR(xCharsForTx,&data,&xHigherPriorityTaskWoken);
			MAP_UARTCharPutNonBlocking(g_ui32Base,data);
		}

		//
		// If the output buffer is empty, turn off the transmit interrupt.
		//
		if(xQueueIsQueueEmptyFromISR(xCharsForTx))
		{
			MAP_UARTIntDisable(g_ui32Base, UART_INT_TX);
		}
	}

	//
	// Are we being interrupted due to a received character?
	//
	if(ui32Ints & (UART_INT_RX | UART_INT_RT))
	{
		//
		// Get all the available characters from the UART.
		//
		while(MAP_UARTCharsAvail(g_ui32Base))
		{
			//
			// Read a character
			//
			i32Char = MAP_UARTCharGetNonBlocking(g_ui32Base);
			cChar = (unsigned char)(i32Char & 0xFF);

			//
			// If there is space in the receive buffer, put the character
			// there, otherwise throw it away.
			//

			xQueueSendFromISR(xRxedChars,&cChar,&xHigherPriorityTaskWoken);
		}
	}

	portYIELD_FROM_ISR( xHigherPriorityTaskWoken );

}




//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
